src/com/a9ae0b01f0ffc/tpn/conf/new/TEMPLATES/wdip_bank.txt

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/" xmlns:a="https://wp1.wirecard.com/TransactionNotification/Fleet">
   <soap:Header/>
   <soap:Body>
      <tem:TransactionNotificationRequest>
         <a:header>
            <a:UserName>${std_format.UserName}</a:UserName>
            <a:Password>${std_format.Password}</a:Password>
            <a:UniqueID>${std_format.UniqueID}</a:UniqueID>
            <a:UniqueIDflag>${std_format.UniqueIDflag}</a:UniqueIDflag>
         </a:header>
         <a:product>
            <a:productID>${std_format.productID}</a:productID>
            <a:productName>${std_format.productName}</a:productName>
            <a:programManager>${std_format.programManager}</a:programManager>
            <a:productCategory>${std_format.productCategory}</a:productCategory>
            <a:subProductType>${std_format.subProductType}</a:subProductType>
         </a:product>
         <a:businessAccount>
            <a:sourceBusinessName>${std_format.sourceBusinessName}</a:sourceBusinessName>
            <a:sourceBusinessAccountNumber>${std_format.sourceBusinessAccountNumber}</a:sourceBusinessAccountNumber>
            <a:businessName>${std_format.businessName}</a:businessName>
            <a:businessAccountNumber>${std_format.businessAccountNumber}</a:businessAccountNumber>
         </a:businessAccount>
         <a:card>
            <a:sourceCardNumber>${std_format.sourceCardNumber}</a:sourceCardNumber>
            <a:sourceProxyNumber>${std_format.sourceProxyNumber}</a:sourceProxyNumber>
            <a:cardNumber>${std_format.cardNumber}</a:cardNumber>
            <a:proxyNumber>${std_format.proxyNumber}</a:proxyNumber>
            <a:cardSequenceNumber>${std_format.cardSequenceNumber}</a:cardSequenceNumber>
         </a:card>
         <a:account>
            <a:sourceAccountNumber>${std_format.sourceAccountNumber}</a:sourceAccountNumber>
            <a:sourceAccountCurrency>${std_format.sourceAccountCurrency}</a:sourceAccountCurrency>
            <a:sourceAccountBalanceInt>${std_format.sourceAccountBalanceInt}</a:sourceAccountBalanceInt>
            <a:sourceAccountBalanceDec>${std_format.sourceAccountBalanceDec}</a:sourceAccountBalanceDec>
            <a:AccountNumber>${std_format.AccountNumber}</a:AccountNumber>
            <a:AccountCurrency>${std_format.AccountCurrency}</a:AccountCurrency>
            <a:AccountBalanceInt>${std_format.AccountBalanceInt}</a:AccountBalanceInt>
            <a:AccountBalanceDec>${std_format.AccountBalanceDec}</a:AccountBalanceDec>
         </a:account>
         <a:transaction>
            <a:transactionId>${std_format.transactionId}</a:transactionId>
            <a:transactionCode>${std_format.transactionCode}</a:transactionCode>
            <a:transactionDescription>${std_format.transactionDescription}</a:transactionDescription>
            <a:transactionTimeStamp>${std_format.transactionTimeStamp}</a:transactionTimeStamp>
            <a:transactionLocalDate>${std_format.transactionLocalDate}</a:transactionLocalDate>
            <a:transactionLocalTime>${std_format.transactionLocalTime}</a:transactionLocalTime>
            <a:transactionLifecycleState>${std_format.transactionLifecycleState}</a:transactionLifecycleState>
            <a:transactionOriginalId>${std_format.transactionOriginalId}</a:transactionOriginalId>
            <a:messageTypeIdentifier>${std_format.messageTypeIdentifier}</a:messageTypeIdentifier>
            <a:transactionResponseCode>${std_format.transactionResponseCode}</a:transactionResponseCode>
            <a:debitCreditFlag>${std_format.debitCreditFlag}</a:debitCreditFlag>
            <a:logicModule>${std_format.logicModule}</a:logicModule>
            <a:transactionPostingDate>${std_format.transactionPostingDate}</a:transactionPostingDate>
            <a:transactionPostingTime>${std_format.transactionPostingTime}</a:transactionPostingTime>
            <a:postingFlag>${std_format.postingFlag}</a:postingFlag>
            <a:postingReference>${std_format.postingReference}</a:postingReference>
            <a:postingTransactionSource>${std_format.postingTransactionSource}</a:postingTransactionSource>
            <a:originalTransactionSource>${std_format.originalTransactionSource}</a:originalTransactionSource>
         </a:transaction>
         <a:network>
            <a:networkName>${std_format.networkName}</a:networkName>
            <a:networkTransactionId>${std_format.networkTransactionId}</a:networkTransactionId>
            <a:networkProcessingCode>${std_format.networkProcessingCode}</a:networkProcessingCode>
            <a:networkRRN>${std_format.networkRRN}</a:networkRRN>
            <a:networkSTAN>${std_format.networkSTAN}</a:networkSTAN>
            <a:networkResponseCode>${std_format.networkResponseCode}</a:networkResponseCode>
         </a:network>
         <a:amounts>
            <a:sourcePostedCurrency>${std_format.sourcePostedCurrency}</a:sourcePostedCurrency>
            <a:sourcePostedAmountInt>${std_format.sourcePostedAmountInt}</a:sourcePostedAmountInt>
            <a:sourcePostedAmountDec>${std_format.sourcePostedAmountDec}</a:sourcePostedAmountDec>
            <a:transactionCurrency>${std_format.transactionCurrency}</a:transactionCurrency>
            <a:transactionAmountInt>${std_format.transactionAmountInt}</a:transactionAmountInt>
            <a:transactionAmountDec>${std_format.transactionAmountDec}</a:transactionAmountDec>
            <a:billingCurrency>${std_format.billingCurrency}</a:billingCurrency>
            <a:billingAmountInt>${std_format.billingAmountInt}</a:billingAmountInt>
            <a:billingAmountDec>${std_format.billingAmountDec}</a:billingAmountDec>
            <a:postedCurrency>${std_format.postedCurrency}</a:postedCurrency>
            <a:postedAmountInt>${std_format.postedAmountInt}</a:postedAmountInt>
            <a:postedAmountDec>${std_format.postedAmountDec}</a:postedAmountDec>
            <a:additionalAmountCurrency>${std_format.additionalAmountCurrency}</a:additionalAmountCurrency>
            <a:additionalAmountInt>${std_format.additionalAmountInt}</a:additionalAmountInt>
            <a:additionalAmountDec>${std_format.additionalAmountDec}</a:additionalAmountDec>
         </a:amounts>
         <a:fees/>
         <a:pos_merchant>
            <a:acquirerId>${std_format.acquirerId}</a:acquirerId>
            <a:acquirerCountry>${std_format.acquirerCountry}</a:acquirerCountry>
            <a:acquirerInstitutionIDCode>${std_format.acquirerInstitutionIDCode}</a:acquirerInstitutionIDCode>
            <a:storeNumber>${std_format.storeNumber}</a:storeNumber>
            <a:terminalId>${std_format.terminalId}</a:terminalId>
            <a:terminalType>${std_format.terminalType}</a:terminalType>
            <a:terminalCategory>${std_format.terminalCategory}</a:terminalCategory>
            <a:terminalEntry>${std_format.terminalEntry}</a:terminalEntry>
            <a:cardAcceptorIDCode>${std_format.cardAcceptorIDCode}</a:cardAcceptorIDCode>
            <a:cardAcceptorterminalIDCode>${std_format.cardAcceptorterminalIDCode}</a:cardAcceptorterminalIDCode>
            <a:merchantId>${std_format.merchantId}</a:merchantId>
            <a:merchantCode>${std_format.merchantCode}</a:merchantCode>
            <a:merchantName>${std_format.merchantName}</a:merchantName>
            <a:merchantAddress>${std_format.merchantAddress}</a:merchantAddress>
            <a:merchantCity>${std_format.merchantCity}</a:merchantCity>
            <a:merchantCountry>${std_format.merchantCountry}</a:merchantCountry>
            <a:merchantType>${std_format.merchantType}</a:merchantType>
            <a:posEntryMode>${std_format.posEntryMode}</a:posEntryMode>
            <a:posConditionCode>${std_format.posConditionCode}</a:posConditionCode>
            <a:posPINCaptureCode>${std_format.posPINCaptureCode}</a:posPINCaptureCode>
            <a:nationalPOSGeographicData>${std_format.nationalPOSGeographicData}</a:nationalPOSGeographicData>
            <a:chipCondition>${std_format.chipCondition}</a:chipCondition>
            <a:chipTransactionFlag>${std_format.chipTransactionFlag}</a:chipTransactionFlag>
            <a:paymentIndicator>${std_format.paymentIndicator}</a:paymentIndicator>
            <a:cardholderId>${std_format.cardholderId}</a:cardholderId>
         </a:pos_merchant>
      </tem:TransactionNotificationRequest>
   </soap:Body>
</soap:Envelope>